Revit 2024 API
Toposolid.Create Method
Overload List
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId)
 Creates a new instance of toposolid within the project.
Create(Document, IList<XYZ>, ElementId, ElementId)
 Creates a new instance of toposolid within the project.
Create(Document, IList<CurveLoop>, IList<XYZ>, ElementId, ElementId)
 Creates a new instance of toposolid within the project.
See Also
Toposolid Class
Toposolid Members
Autodesk.Revit.DB Namespace